[
    {
        "title": "Failure at Fifty",
        "series": "What a Life",
        "order": 1,
        "asin": "1806236915",
        "siteStripeLink": "https://amzn.to/46H2JWo",
        "coverFront": "/images/faf-front.jpg",
        "coverBack": "/images/faf-back.jpg",
        "description": [
            "What happens when alcohol and mental illness collide at the most pivotal moments of life?",
            "In Failure at Fifty, Linear Descent delivers a raw, unflinching memoir about surviving addiction, schizophrenia, and the crushing weight of personal failure. From the innocence of childhood to the chaos of high school bullying, from chasing dreams in college to falling into the grip of alcohol and mental health struggles, this is a story of how everything can unravel—and how one can still find the strength to stand again.",
            "Told with brutal honesty, dark humor, and unapologetic self-reflection, this memoir sheds light on:",
            "Growing up with fractured family dynamics and childhood trauma",
            "Early encounters with alcohol and the spiral of addiction",
            "The challenges of living with schizophrenia and mental illness",
            "The devastating impact on love, work, and parenting",
            "Hard-won lessons about resilience, hope, and starting over",
            "This is not a sanitized recovery story—it’s a candid, gripping account for anyone who has wrestled with failure, battled their inner demons, or loved someone who has.",
            "If you are drawn to powerful memoirs about mental health, addiction recovery, and personal transformation—like A Million Little Pieces by James Frey or Tweak by Nic Sheff—Failure at Fifty will resonate deeply with you.",
            "Discover how one man faced the wreckage of his past, confronted his addictions, and began searching for meaning in the aftermath of nearly losing everything."
        ],
        "seriesDescription": [
            "What a Life",
            "What happens when everything you thought you controlled begins to collapse: your career, your health, your family, even your mind?",
            "The What a Life series is the unforgettable true journey of one man who faced it all: addiction, mental illness, betrayal, and loss, and lived to tell the story.",
            "In Failure at Fifty, the spiral begins. Alcohol and schizophrenia nearly consume his life, tearing apart everything he once held dear. Raw, brutal, and darkly funny, this opening memoir is a wake-up call for anyone who’s ever been close to the edge.",
            "In Fifty-One Ways to Lie, desperation takes a darker turn, pulling him into the grip of an international crime syndicate. Lies, survival, and betrayal collide in this shocking account of how quickly one decision can turn into a life-altering storm.",
            "Finally, Better Life Beyond Fifty offers the hard-won light at the end of the tunnel. With music, family, and self-discovery as anchors, the author rebuilds a future, proving resilience is possible even after decades of chaos.",
            "Honest. Heartbreaking. Inspiring. What a Life is not just a memoir series. It is proof that even in the darkest chapters, there is always another page worth turning."
        ]
    },
    {
        "title": "Fifty-One Ways to Lie",
        "series": "What a Life",
        "order": 2,
        "asin": "1806238187",
        "siteStripeLink": "https://amzn.to/4pEnWZX",
        "coverFront": "/images/fowtl-front.jpg",
        "coverBack": "/images/fowtl-back.jpg",
        "description": [
            "Fifty-One Ways to Lie: How I Got Involved With an International Crime Syndicate is a shocking true account of deception, desperation, and survival in a world where lies become currency.",
            "Author Linear Descent takes readers inside a hidden underworld that preys on the vulnerable and the desperate. What begins as a simple search for employment spirals into entanglement with an international crime syndicate, where fake résumés, coerced contracts, and fraudulent interviews are all part of the game. Promises of wealth and prestige quickly give way to manipulation, exploitation, and the crushing realization of being a pawn in a global web of deceit.",
            "Blending memoir and exposé, this book reveals how easily one can be lured into a corporate nightmare masked as opportunity. With raw honesty, the author describes the psychological toll — schizophrenia, paranoia, and fractured trust — while also exposing the systemic corruption that enables such organizations to thrive.",
            "This isn’t just a personal confession. It’s a warning. For job seekers, tech professionals, or anyone navigating the lure of “too good to be true” opportunities, Fifty-One Ways to Lie is both a survival manual and a cautionary tale.",
            "Perfect for readers of true crime memoirs, corporate corruption exposés, and mental health survival stories, this book uncovers the fine line between ambition and destruction — and what it takes to reclaim your voice after being silenced by lies."
        ],
        "seriesDescription": [
            "What a Life",
            "What happens when everything you thought you controlled begins to collapse: your career, your health, your family, even your mind?",
            "The What a Life series is the unforgettable true journey of one man who faced it all: addiction, mental illness, betrayal, and loss, and lived to tell the story.",
            "In Failure at Fifty, the spiral begins. Alcohol and schizophrenia nearly consume his life, tearing apart everything he once held dear. Raw, brutal, and darkly funny, this opening memoir is a wake-up call for anyone who’s ever been close to the edge.",
            "In Fifty-One Ways to Lie, desperation takes a darker turn, pulling him into the grip of an international crime syndicate. Lies, survival, and betrayal collide in this shocking account of how quickly one decision can turn into a life-altering storm.",
            "Finally, Better Life Beyond Fifty offers the hard-won light at the end of the tunnel. With music, family, and self-discovery as anchors, the author rebuilds a future, proving resilience is possible even after decades of chaos.",
            "Honest. Heartbreaking. Inspiring. What a Life is not just a memoir series. It is proof that even in the darkest chapters, there is always another page worth turning."
        ]
    },
    {
        "title": "Better Life Beyond Fifty",
        "series": "What a Life",
        "order": 3,
        "asin": "1806238217",
        "siteStripeLink": "https://amzn.to/42QT4LI",
        "coverFront": "/images/blbf-front.jpg",
        "coverBack": "/images/blbf-back.jpg",
        "description": [
            "Better Life Beyond Fifty is a raw, reflective, and inspiring memoir about resilience, growth, and reclaiming purpose after a life marked by struggles with addiction, mental illness, and personal loss.",
            "In this powerful third installment of his life story, author Linear Descent shifts from the darker tones of his first two books to a more hopeful, uplifting narrative. With honesty and grit, he shares his journey of battling schizophrenia, overcoming alcoholism, navigating fractured family ties, and rediscovering the healing power of music, faith, and love.",
            "In this powerful third installment of his life story, author Linear Descent shifts from the darker tones of his first two books to a more hopeful, uplifting narrative. With honesty and grit, he shares his journey of battling schizophrenia, overcoming alcoholism, navigating fractured family ties, and rediscovering the healing power of music, faith, and love.",
            "For readers seeking memoirs, inspirational books, or self-help stories about purpose, addiction recovery, and mental health, Better Life Beyond Fifty delivers both raw truth and practical encouragement. It’s not about being perfect; it’s about being better than you were yesterday.",
            "If you’ve ever asked yourself how to keep moving forward when life feels like it has beaten you down, this book is a reminder that the next chapter can still be the best one."
        ],
        "seriesDescription": [
            "What a Life",
            "What happens when everything you thought you controlled begins to collapse: your career, your health, your family, even your mind?",
            "The What a Life series is the unforgettable true journey of one man who faced it all: addiction, mental illness, betrayal, and loss, and lived to tell the story.",
            "In Failure at Fifty, the spiral begins. Alcohol and schizophrenia nearly consume his life, tearing apart everything he once held dear. Raw, brutal, and darkly funny, this opening memoir is a wake-up call for anyone who’s ever been close to the edge.",
            "In Fifty-One Ways to Lie, desperation takes a darker turn, pulling him into the grip of an international crime syndicate. Lies, survival, and betrayal collide in this shocking account of how quickly one decision can turn into a life-altering storm.",
            "Finally, Better Life Beyond Fifty offers the hard-won light at the end of the tunnel. With music, family, and self-discovery as anchors, the author rebuilds a future, proving resilience is possible even after decades of chaos.",
            "Honest. Heartbreaking. Inspiring. What a Life is not just a memoir series. It is proof that even in the darkest chapters, there is always another page worth turning."
        ]
    }
]